<template>
  <div class="application">
    <details class="application-title">
      <summary>Заявки</summary>
      <details class="application-actual">
        <summary>Актуальные</summary>
        <p><b>Имя:</b> ООО Россети<br><b>Дата добавления:</b> 02.02.2022<br><b>Оборудование:</b> компьютер<br><b>Тип
            неисправности:</b> механическая<br><b>Описание проблемы:</b> что-то поломало моё устройство вчера
          вечером.<br><b>Клиент:</b> Максим Олегов Николаевич<br><b>Статус:</b> в работе</p>
        <p><b>Имя:</b> ООО Россети<br><b>Дата добавления:</b> 02.02.2022<br><b>Оборудование:</b> компьютер<br><b>Тип
            неисправности:</b> механическая<br><b>Описание проблемы:</b> что-то поломало моё устройство вчера
          вечером.<br><b>Клиент:</b> Максим Олегов Николаевич<br><b>Статус:</b> в работе</p>
        <p><b>Имя:</b> ООО Россети<br><b>Дата добавления:</b> 02.02.2022<br><b>Оборудование:</b> компьютер<br><b>Тип
            неисправности:</b> механическая<br><b>Описание проблемы:</b> что-то поломало моё устройство вчера
          вечером.<br><b>Клиент:</b> Максим Олегов Николаевич<br><b>Статус:</b> в работе</p>
        <p><b>Имя:</b> ООО Россети<br><b>Дата добавления:</b> 02.02.2022<br><b>Оборудование:</b> компьютер<br><b>Тип
            неисправности:</b> механическая<br><b>Описание проблемы:</b> что-то поломало моё устройство вчера
          вечером.<br><b>Клиент:</b> Максим Олегов Николаевич<br><b>Статус:</b> в работе</p>
        <p><b>Имя:</b> ООО Россети<br><b>Дата добавления:</b> 02.02.2022<br><b>Оборудование:</b> компьютер<br><b>Тип
            неисправности:</b> механическая<br><b>Описание проблемы:</b> что-то поломало моё устройство вчера
          вечером.<br><b>Клиент:</b> Максим Олегов Николаевич<br><b>Статус:</b> в работе</p>
        <p><b>Имя:</b> ООО Россети<br><b>Дата добавления:</b> 02.02.2022<br><b>Оборудование:</b> компьютер<br><b>Тип
            неисправности:</b> механическая<br><b>Описание проблемы:</b> что-то поломало моё устройство вчера
          вечером.<br><b>Клиент:</b> Максим Олегов Николаевич<br><b>Статус:</b> в работе</p>
        <p><b>Имя:</b> ООО Россети<br><b>Дата добавления:</b> 02.02.2022<br><b>Оборудование:</b> компьютер<br><b>Тип
            неисправности:</b> механическая<br><b>Описание проблемы:</b> что-то поломало моё устройство вчера
          вечером.<br><b>Клиент:</b> Максим Олегов Николаевич<br><b>Статус:</b> в работе</p>

      </details>
      <details class="application-completed">
        <summary>Завершенные</summary>
        <p><b>Имя:</b> ООО Россети<br><b>Дата добавления:</b> 02.02.2022<br><b>Оборудование:</b> компьютер<br><b>Тип
            неисправности:</b> механическая<br><b>Описание проблемы:</b> что-то поломало моё устройство вчера
          вечером.<br><b>Клиент:</b> Максим Олегов Николаевич<br><b>Статус:</b> выполнено</p>
        <p><b>Имя:</b> ООО Россети<br><b>Дата добавления:</b> 02.02.2022<br><b>Оборудование:</b> компьютер<br><b>Тип
            неисправности:</b> механическая<br><b>Описание проблемы:</b> что-то поломало моё устройство вчера
          вечером.<br><b>Клиент:</b> Максим Олегов Николаевич<br><b>Статус:</b> выполнено</p>
        <p><b>Имя:</b> ООО Россети<br><b>Дата добавления:</b> 02.02.2022<br><b>Оборудование:</b> компьютер<br><b>Тип
            неисправности:</b> механическая<br><b>Описание проблемы:</b> что-то поломало моё устройство вчера
          вечером.<br><b>Клиент:</b> Максим Олегов Николаевич<br><b>Статус:</b> выполнено</p>
        <p><b>Имя:</b> ООО Россети<br><b>Дата добавления:</b> 02.02.2022<br><b>Оборудование:</b> компьютер<br><b>Тип
            неисправности:</b> механическая<br><b>Описание проблемы:</b> что-то поломало моё устройство вчера
          вечером.<br><b>Клиент:</b> Максим Олегов Николаевич<br><b>Статус:</b> выполнено</p>
        <p><b>Имя:</b> ООО Россети<br><b>Дата добавления:</b> 02.02.2022<br><b>Оборудование:</b> компьютер<br><b>Тип
            неисправности:</b> механическая<br><b>Описание проблемы:</b> что-то поломало моё устройство вчера
          вечером.<br><b>Клиент:</b> Максим Олегов Николаевич<br><b>Статус:</b> выполнено</p>
        <p><b>Имя:</b> ООО Россети<br><b>Дата добавления:</b> 02.02.2022<br><b>Оборудование:</b> компьютер<br><b>Тип
            неисправности:</b> механическая<br><b>Описание проблемы:</b> что-то поломало моё устройство вчера
          вечером.<br><b>Клиент:</b> Максим Олегов Николаевич<br><b>Статус:</b> выполнено</p>
        <p><b>Имя:</b> ООО Россети<br><b>Дата добавления:</b> 02.02.2022<br><b>Оборудование:</b> компьютер<br><b>Тип
            неисправности:</b> механическая<br><b>Описание проблемы:</b> что-то поломало моё устройство вчера
          вечером.<br><b>Клиент:</b> Максим Олегов Николаевич<br><b>Статус:</b> выполнено</p>
      </details>
    </details>
  </div>
</template>

<script lang="ts" setup>

</script>

<style lang="scss" scoped>
summary {
  user-select: none;
  padding: 2px;
  cursor: pointer;
  list-style: none;
}

details {
  p {
    word-wrap: normal;
    margin-left: 23px;
  }
}

b {
  font-weight: 500;
}

.application {
  width: 700px;
  margin-bottom: 100px;
  border: 2px solid #D9D9D9;
  border-radius: 17px;
  padding: 13px 30px;
}

.application-actual summary,
.application-completed summary {
  list-style-type: circle;
  margin: 10px 0 10px 20px;
}

.application-actual[open]>summary,
.application-completed[open]>summary {
  list-style-type: disc;
}

.application-actual {
  margin-top: 30px;
}
</style>