<template>
<div class="form">
  <form @submit.prevent="send_application">
    <div class="form-input">
      <label for="type_of_fault">Оборудование</label>
      <select v-model="equipment" required>
        <option value="" disabled selected>Выберите оборудование</option>
        <option v-for="equip in equipments" :value="equip.name">{{ equip.name }}</option>
      </select>
    </div>
    <div class="form-input">
      <label for="type_of_fault">Тип неисправности</label>
      <select v-model="type_of_fault" required>
        <option value="" disabled selected>Выберите тип проблемы</option>
        <option v-for="fault in getFaults()" :value="fault">{{ fault }}</option>
      </select>
    </div>
    <div class="form-input">
      <label for="problem_description">Описание проблемы</label>
      <input type="text" v-model="problem_description" required>
    </div>
    <button type="submit">Оставить заявку</button>
  </form>
</div>
</template>

<script lang="ts" setup>
import { ref } from 'vue';
import { useApplicationsStore } from '~/store/applications.store';

const equipment = ref('')
const type_of_fault = ref('')
const problem_description = ref('')

const store = useApplicationsStore();

const equipments = [
  {
    "name": "Персональный компьютер",
    "faults": [
      "Перегрев",
      "Сбой в программном обеспечении",
      "Поломка жесткого диска",
      "Механический износ",
      "Другое"
    ]
  },
  {
    "name": "Ноутбук",
    "faults": [
      "Повреждение экрана",
      "Поломка клавиатуры",
      "Проблемы с аккумулятором",
      "Короткое замыкание",
      "Другое"
    ]
  },
  {
    "name": "Принтер",
    "faults": [
      "Засорение картриджа",
      "Поломка бумагодержателя",
      "Неисправность фьюзера",
      "Ошибка печати",
      "Другое"
    ]
  },
  {
    "name": "Сканер",
    "faults": [
      "Проблемы с калибровкой",
      "Повреждение стекла",
      "Сбой программного обеспечения",
      "Низкое качество сканирования",
      "Другое"
    ]
  },
  {
    "name": "Факс",
    "faults": [
      "Неполадки связи",
      "Поломка барабана",
      "Засорение бумагодержателя",
      "Ошибка передачи данных",
      "Другое"
    ]
  },
  {
    "name": "МФУ (многофункциональное устройство)",
    "faults": [
      "Неисправность принтера",
      "Сбой сканера",
      "Проблемы с факсом",
      "Ошибка копирования",
      "Другое"
    ]
  },
  {
    "name": "Телефонная станция",
    "faults": [
      "Проблемы со связью",
      "Неисправность аппарата",
      "Сбой программного обеспечения",
      "Повреждение кабелей",
      "Другое"
    ]
  },
  {
    "name": "Сетевой маршрутизатор",
    "faults": [
      "Перегрев",
      "Сбой в программном обеспечении",
      "Неисправность портов",
      "Потеря соединения",
      "Другое"
    ]
  },
  {
    "name": "Коммутатор (свитч)",
    "faults": [
      "Проблемы с питанием",
      "Неисправность портов",
      "Перегрев",
      "Проблемы с соединением",
      "Другое"
    ]
  },
  {
    "name": "Модем",
    "faults": [
      "Неполадки связи",
      "Перегрев",
      "Сбой в программном обеспечении",
      "Неисправность разъемов",
      "Другое"
    ]
  },
  {
    "name": "Источник бесперебойного питания (ИБП)",
    "faults": [
      "Неисправность аккумулятора",
      "Перегрев",
      "Поломка вентилятора",
      "Сбой инвертора",
      "Другое"
    ]
  },
  {
    "name": "Проектор",
    "faults": [
      "Поломка лампы",
      "Проблемы с фокусировкой",
      "Перегрев",
      "Сбой в программном обеспечении",
      "Другое"
    ]
  },
  {
    "name": "Копировальный аппарат",
    "faults": [
      "Засорение бумаги",
      "Поломка картриджа",
      "Проблемы с калибровкой",
      "Ошибка копирования",
      "Другое"
    ]
  },
  {
    "name": "Шредер (уничтожитель документов)",
    "faults": [
      "Засорение",
      "Перегрев",
      "Поломка ножей",
      "Неисправность двигателя",
      "Другое"
    ]
  },
  {
    "name": "Система видеонаблюдения",
    "faults": [
      "Неисправность камеры",
      "Сбой в программном обеспечении",
      "Проблемы с записью",
      "Перегрев",
      "Другое"
    ]
  },
  {
    "name": "Контрольно-кассовая машина (ККМ)",
    "faults": [
      "Сбой программного обеспечения",
      "Неисправность принтера",
      "Проблемы с дисплеем",
      "Поломка клавиатуры",
      "Другое"
    ]
  },
  {
    "name": "Банкомат",
    "faults": [
      "Неисправность купюроприемника",
      "Проблемы с дисплеем",
      "Сбой программного обеспечения",
      "Перегрев",
      "Другое"
    ]
  },
  {
    "name": "Платежный терминал",
    "faults": [
      "Проблемы с картридером",
      "Сбой программного обеспечения",
      "Неисправность дисплея",
      "Поломка клавиатуры",
      "Другое"
    ]
  },
  {
    "name": "Лазерный принтер",
    "faults": [
      "Засорение картриджа",
      "Неисправность фьюзера",
      "Проблемы с подачей бумаги",
      "Ошибка печати",
      "Другое"
    ]
  },
  {
    "name": "3D-принтер",
    "faults": [
      "Засорение сопла",
      "Проблемы с калибровкой",
      "Поломка нагревательного элемента",
      "Сбой в программном обеспечении",
      "Другое"
    ]
  },
  {
    "name": "Другое",
    "faults": [
      "Другое"
    ]
  }
]

const getFaults = () => {
  const equip = equipments.find(e => e.name === equipment.value)
  return equip ? equip.faults : [];
}

const send_application = async () => {
  const data = await $fetch('/api/applications/create', {
    method: "POST",
    body: {
      equipment: equipment.value,
      issueType: type_of_fault.value,
      description: problem_description.value
    }
  })

  store.addApplication(data.data)

  if (!(data.status)) {
    alert("Ошибка создания заявки")
  }
}
</script>

<style lang="scss">
select {
  appearance: none
}
</style>